microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.h
/*
 * -------------------------------------------------------------------
 * MPLAB Device Blocks for Simulink v3.50.30 (21-Nov-2022)
 *
 *   Product Page:  https://www.mathworks.com/matlabcentral/fileexchange/71892
 *           Forum: https://www.microchip.com/forums/f192.aspx
 *           Wiki:  http://microchip.wikidot.com/simulink:start
 * -------------------------------------------------------------------
 * File: dsPIC33CK256MP508_SMO_LVMC.h
 *
 * Code generated for Simulink model 'dsPIC33CK256MP508_SMO_LVMC'.
 *
 * Model version                  : 7.14
 * Simulink Coder version         : 9.7 (R2022a) 13-Nov-2021
 * C/C++ source code generated on : Thu Mar 16 10:58:36 2023
 */

#ifndef RTW_HEADER_dsPIC33CK256MP508_SMO_LVMC_h_
#define RTW_HEADER_dsPIC33CK256MP508_SMO_LVMC_h_
#ifndef dsPIC33CK256MP508_SMO_LVMC_COMMON_INCLUDES_
#define dsPIC33CK256MP508_SMO_LVMC_COMMON_INCLUDES_
#include "rtwtypes.h"
#endif                         /* dsPIC33CK256MP508_SMO_LVMC_COMMON_INCLUDES_ */

#define FCY                            (100000000UL)             /* Instruction Frequency FCY set at  100.0 MHz */

/* Include for pic 33C */
#include <xc.h>
#include <libpic30.h>
/* For possible use with C function Call block (delay_ms or delay_us functions might be used by few peripherals) */
#include "dsPIC33CK256MP508_SMO_LVMC_types.h"
#include <stddef.h>
#include <string.h>
#include "zero_crossing_types.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmCounterLimit
#define rtmCounterLimit(rtm, idx)      ((rtm)->Timing.TaskCounters.cLimit[(idx)])
#endif

#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

/* Block signals (default storage) */
typedef struct {
  uint32_T Add1;                       /* '<S142>/Add1' */
  uint16_T U2CH2;                      /* '<S7>/ADC dsPIC High Speed SAR' */
  uint16_T Saturationlowsideturnon[3]; /* '<S6>/Saturation low side turn  on' */
  uint16_T Mode;                       /* '<S148>/Chart' */
  int16_T Gain8;                       /* '<S149>/Gain8' */
  int16_T Speed_Ref;                   /* '<S1>/Data Store Read' */
  int16_T DataTypeConversion;          /* '<S7>/Data Type Conversion' */
  int16_T RateTransition6;             /* '<Root>/Rate Transition6' */
  int16_T RateTransition7;             /* '<Root>/Rate Transition7' */
  int16_T Id_ref;                      /* '<S4>/Id_ref' */
  int16_T Switch;                      /* '<S4>/Switch' */
  int16_T ADCdsPICHighSpeedSAR_o1;     /* '<S7>/ADC dsPIC High Speed SAR' */
  int16_T ADCdsPICHighSpeedSAR_o2;     /* '<S7>/ADC dsPIC High Speed SAR' */
  int16_T Iab[2];                      /* '<S139>/Iab' */
  uint8_T TmpSignalConversionAtUARTTxInport1[5];
} B_dsPIC33CK256MP508_SMO_LVMC_T;

/* Block states (default storage) for system '<Root>' */
typedef struct {
  uint32_T Delay_DSTATE;               /* '<S142>/Delay' */
  int32_T DiscreteTimeIntegrator_DSTATE;/* '<S147>/Discrete-Time Integrator' */
  int16_T Delay_DSTATE_h[4];           /* '<S1>/Delay' */
  int16_T Integrator_DSTATE;           /* '<S58>/Integrator' */
  int16_T Integrator_DSTATE_d;         /* '<S109>/Integrator' */
  int16_T UnitDelay_DSTATE;            /* '<S235>/Unit Delay' */
  int16_T Integrator_DSTATE_f;         /* '<S216>/Integrator' */
  int16_T UniDelay_DSTATE;             /* '<S151>/Uni Delay' */
  int16_T DiscreteTimeIntegrator_DSTATE_l;/* '<S150>/Discrete-Time Integrator' */
  int16_T UnitDelay3_DSTATE;           /* '<S157>/Unit Delay3' */
  int16_T Delay_DSTATE_i[2];           /* '<S154>/Delay' */
  int16_T DiscreteTimeIntegrator_DSTATE_e[2];/* '<S154>/Discrete-Time Integrator' */
  int16_T Delay3_DSTATE[2];            /* '<S154>/Delay3' */
  int16_T DiscreteTimeIntegrator2_DSTATE[2];/* '<S154>/Discrete-Time Integrator2' */
  int16_T Delay2_DSTATE[2];            /* '<S149>/Delay2' */
  int16_T DiscreteTimeIntegrator3_DSTATE[2];/* '<S149>/Discrete-Time Integrator3' */
  int16_T Delay1_DSTATE;               /* '<S157>/Delay1' */
  int16_T DiscreteTimeIntegrator4_DSTATE;/* '<S157>/Discrete-Time Integrator4' */
  uint16_T temporalCounter_i1;         /* '<S148>/Chart' */
  volatile int16_T RateTransition5_Buffer[4];/* '<Root>/Rate Transition5' */
  int16_T SpeedRef;                    /* '<Root>/Data Store Memory4' */
  int16_T PrevY;                       /* '<S4>/Rate Limiter2' */
  uint8_T Output_DSTATE;               /* '<S161>/Output' */
  boolean_T Delay_DSTATE_n;            /* '<S140>/Delay' */
  boolean_T Delay_DSTATE_a;            /* '<S180>/Delay' */
  boolean_T UniDelay1_DSTATE;          /* '<S151>/Uni Delay1' */
  uint8_T Output_DSTATE_p;             /* '<S169>/Output' */
  uint8_T Output_DSTATE_l;             /* '<S168>/Output' */
  volatile int8_T RateTransition5_ActiveBufIdx;/* '<Root>/Rate Transition5' */
  int8_T Integrator_PrevResetState;    /* '<S58>/Integrator' */
  int8_T Integrator_PrevResetState_a;  /* '<S109>/Integrator' */
  int8_T Integrator_PrevResetState_o;  /* '<S216>/Integrator' */
  uint8_T is_active_c3_dsPIC33CK256MP508_SMO_LVMC;/* '<S148>/Chart' */
  uint8_T is_c3_dsPIC33CK256MP508_SMO_LVMC;/* '<S148>/Chart' */
  uint8_T DiscreteTimeIntegrator_IC_LOADING;/* '<S150>/Discrete-Time Integrator' */
  boolean_T EnableFOC;                 /* '<Root>/Data Store Memory29' */
  boolean_T Enable;                    /* '<Root>/Data Store Memory3' */
  boolean_T EnableClosedLoop;          /* '<Root>/Data Store Memory6' */
  boolean_T UpCounter_MODE;            /* '<S140>/Up Counter' */
} DW_dsPIC33CK256MP508_SMO_LVMC_T;

/* Zero-crossing (trigger) state */
typedef struct {
  ZCSigState TriggeredSubsystem_Trig_ZCE;/* '<S179>/Triggered Subsystem' */
  ZCSigState OpenloopPos_PU_Reset_ZCE; /* '<S9>/Openloop Pos_PU' */
} PrevZCX_dsPIC33CK256MP508_SMO_LVMC_T;

/* Constant parameters (default storage) */
typedef struct {
  /* Computed Parameter: sine_table_values_Value
   * Referenced by: '<S15>/sine_table_values'
   */
  int16_T sine_table_values_Value[1002];
} ConstP_dsPIC33CK256MP508_SMO_LVMC_T;

/* Real-time Model Data Structure */
struct tag_RTM_dsPIC33CK256MP508_SMO_LVMC_T {
  const char_T * volatile errorStatus;

