microchip-pic-avr-solutions/matlab-lvmc-dspic33ck256mp508-foc-smo/matlab-lvmc-dspic33ck256mp508-foc-smo/dsPIC33CK256MP508_SMO_LVMC.X/dsPIC33CK256MP508_SMO_LVMC.h
 * '<S136>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Closed Loop Control/Space Vector Generator/Modulation method/SVPWM/Half(Vmin+Vmax)'
 * '<S137>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Closed Loop Control/Space Vector Generator/Voltage Input/Valphabeta'
 * '<S138>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Closed Loop Control/Space Vector Generator/Voltage Input/Valphabeta/Inverse Clarke Transform'
 * '<S139>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/MOTOR - Board Sensor/Offset1'
 * '<S140>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Output Scaling/Mode Selector'
 * '<S141>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Output Scaling/Mode Selector/Subsystem1'
 * '<S142>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Output Scaling/Mode Selector/Up Counter'
 * '<S143>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Output Scaling/Mode Selector/Subsystem1/Compare To Constant'
 * '<S144>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Output Scaling/Mode Selector/Subsystem1/Compare To Constant1'
 * '<S145>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Output Scaling/Mode Selector/Subsystem1/Compare To Constant2'
 * '<S146>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Output Scaling/Mode Selector/Subsystem1/Compare To Constant3'
 * '<S147>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Openloop Pos_PU'
 * '<S148>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/OpentoClosed'
 * '<S149>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Sliding Mode Observer'
 * '<S150>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Openloop Pos_PU/Position Generator'
 * '<S151>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Openloop Pos_PU/Position Generator/Reset_Logic'
 * '<S152>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Openloop Pos_PU/Position Generator/Theta_Increment_Source'
 * '<S153>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/OpentoClosed/Chart'
 * '<S154>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Sliding Mode Observer/Adaptive Filter2'
 * '<S155>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Sliding Mode Observer/Scaling'
 * '<S156>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Sliding Mode Observer/Subsystem3'
 * '<S157>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Sliding Mode Observer/Subsystem4'
 * '<S158>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Sliding Mode Observer/atan1'
 * '<S159>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Sliding Mode Observer/Subsystem3/Compare To Constant1'
 * '<S160>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Position and Speed Estimation/Sliding Mode Observer/Subsystem4/Wrap_to_pi2'
 * '<S161>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Serial Tx/Counter Limited'
 * '<S162>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Serial Tx/UART_TX'
 * '<S163>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Serial Tx/Counter Limited/Increment Real World'
 * '<S164>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Serial Tx/Counter Limited/Wrap To Zero'
 * '<S165>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Serial Tx/UART_TX/Debug_Data'
 * '<S166>' : 'dsPIC33CK256MP508_SMO_LVMC/Current Control/Serial Tx/UART_TX/SCI_Tx'
 * '<S167>' : 'dsPIC33CK256MP508_SMO_LVMC/Hardware Init/Model Info'
 * '<S168>' : 'dsPIC33CK256MP508_SMO_LVMC/Heartbeat LED/Counter Free-Running'
 * '<S169>' : 'dsPIC33CK256MP508_SMO_LVMC/Heartbeat LED/Counter Free-Running1'
 * '<S170>' : 'dsPIC33CK256MP508_SMO_LVMC/Heartbeat LED/LED 1'
 * '<S171>' : 'dsPIC33CK256MP508_SMO_LVMC/Heartbeat LED/LED 2'
 * '<S172>' : 'dsPIC33CK256MP508_SMO_LVMC/Heartbeat LED/Counter Free-Running/Increment Real World'
 * '<S173>' : 'dsPIC33CK256MP508_SMO_LVMC/Heartbeat LED/Counter Free-Running/Wrap To Zero'
 * '<S174>' : 'dsPIC33CK256MP508_SMO_LVMC/Heartbeat LED/Counter Free-Running1/Increment Real World'
 * '<S175>' : 'dsPIC33CK256MP508_SMO_LVMC/Heartbeat LED/Counter Free-Running1/Wrap To Zero'
 * '<S176>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/Enable Switch'
 * '<S177>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed'
 * '<S178>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/Speed_Ref_Selector'
 * '<S179>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/Enable Switch/Codegen'
 * '<S180>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/Enable Switch/Codegen/Triggered Subsystem'
 * '<S181>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset'
 * '<S182>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Zero_Cancellation'
 * '<S183>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup'
 * '<S184>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain'
 * '<S185>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter'
 * '<S186>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs'
 * '<S187>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain'
 * '<S188>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain'
 * '<S189>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk'
 * '<S190>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator'
 * '<S191>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs'
 * '<S192>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy'
 * '<S193>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain'
 * '<S194>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy'
 * '<S195>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain'
 * '<S196>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal'
 * '<S197>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation'
 * '<S198>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk'
 * '<S199>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum'
 * '<S200>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk'
 * '<S201>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode'
 * '<S202>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum'
 * '<S203>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral'
 * '<S204>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain'
 * '<S205>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal'
 * '<S206>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal'
 * '<S207>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel'
 * '<S208>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone'
 * '<S209>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Anti-windup/Disc. Clamping Parallel/Dead Zone/Enabled'
 * '<S210>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/D Gain/Disabled'
 * '<S211>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter/Disabled'
 * '<S212>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Filter ICs/Disabled'
 * '<S213>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/I Gain/External Parameters'
 * '<S214>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain/Passthrough'
 * '<S215>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Ideal P Gain Fdbk/Disabled'
 * '<S216>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator/Discrete'
 * '<S217>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Integrator ICs/External IC'
 * '<S218>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Copy/Disabled wSignal Specification'
 * '<S219>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/N Gain/Disabled'
 * '<S220>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/P Copy/Disabled'
 * '<S221>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Parallel P Gain/External Parameters'
 * '<S222>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Reset Signal/External Reset'
 * '<S223>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation/Enabled'
 * '<S224>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Saturation Fdbk/Disabled'
 * '<S225>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum/Sum_PI'
 * '<S226>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Sum Fdbk/Disabled'
 * '<S227>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode/Disabled'
 * '<S228>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tracking Mode Sum/Passthrough'
 * '<S229>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Integral/Passthrough'
 * '<S230>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/Tsamp - Ngain/Passthrough'
 * '<S231>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/postSat Signal/Forward_Path'
 * '<S232>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Discrete PI Controller  with anti-windup & reset/preSat Signal/Forward_Path'
 * '<S233>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter'
 * '<S234>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass'
 * '<S235>' : 'dsPIC33CK256MP508_SMO_LVMC/Speed Control/PI_Controller_Speed/Zero_Cancellation/IIR Filter/Low-pass/IIR Low Pass Filter'
 */
#endif                            /* RTW_HEADER_dsPIC33CK256MP508_SMO_LVMC_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
